import {BaseTypeSeed} from "@src/const/type/base-type-seed";

export const genres: BaseTypeSeed[] = [
    {id: 1, name: "Екшен/Бойовик", description: 'Драматичний жанр, в якому основна увага приділяється дії.'},
    {
        id: 2,
        name: "Мелодрама",
        description: 'Жанр який розкриває духовний і чуттєвий світ героїв в особливо яскравих емоційних обставинах на основі контрастів: добро і зло, любов і ненависть тощо. Також супроводжується трагічними сценами, здебільшого закінчується хепі-ендом.'
    },
    {id: 3, name: "Комедія", description: 'Жанр за мету якого поставлено розсмішити глядача.'},
    {
        id: 4,
        name: "Пригоди",
        description: 'Жанр кіномистецтва. На відміну від екшена, акцент зміщено з грубого насильтва до кмітливості та винахідливості героя, уміння перехитрити злодія.'
    },
    {
        id: 5,
        name: "Детектив",
        description: 'Жанр фантастики, де природа події, як правило, вбивства чи іншого злочину, залишається загадковою до кінця оповідання.'
    },
    {
        id: 6,
        name: "Драма",
        description: 'Жанр кіно і телебачення, який переважно характеризується внутрішніми переживаннями героїв, які стикаються з емоційними темами.'
    },
    {
        id: 7,
        name: "Кримінал",
        description: 'Жанр кінематографа, твори якого містять демонстрацію злочинних діянь та їх розслідування.'
    },
    {id: 8, name: "Спорт", description: 'Жанр де присутні різні види спорту.'},
    {
        id: 9,
        name: "Трилер",
        description: 'Жанр кіно та літератури, в яких специфічні засоби повинні викликати у глядачів або читачів почуття співпереживання, пов\'язане з емоціями тривожного очікування, невизначеності, хвилювання чи страху.'
    },
    {
        id: 10,
        name: "Жахи",
        description: 'Жанр художньої літератури, що початково мав на меті викликати в читача відчуття тривоги, страху і супутніх відчуттів.'
    },
    {
        id: 11,
        name: "Фантастика",
        description: 'Жанр художніх творів, в якому за допомогою додавання вигаданих уявних елементів створюється світ, відмінний від світу сьогоденного, реального.'
    },
    {
        id: 12,
        name: "Фентазі",
        description: 'Піджанр фантастики — одного з жанрів сучасного мистецтва, дія якого відбувається у вигаданому світі, де чудеса і вигадка нашого світу є реальністю. Світ є подібним до Середньовіччя, властивою основою світу є магія, він наповнений чарівними істотами, оповідь епічна, тому час зациклений і йде по колу.'
    },
    {id: 13, name: "Музика", description: 'Жанр що звязаний із музикою. Наприклад танці або музикальні інструменти.'},
    {
        id: 14,
        name: "Біографія",
        description: 'Жанр про відтворення історії життя людини в зв\'язку з суспільною дійсністю, культурою та побутом епохи.'
    },
    {id: 15, name: "Вестерн", description: 'Жанр про освоєння та підкорення Дикого Заходу у XIX столітті.'},
    {id: 16, name: "Романтика", description: 'Жанр в якому є розвиток романтичних стосунків між двома персонажами.'},
    {
        id: 17,
        name: "Сімейний",
        description: 'Жанр, який розрахований на різні вікові групи і тому підходять для перегляду всією сім\'єю.'
    },
    {
        id: 18,
        name: "Документальний",
        description: ' Жанр в основу якого покладені зйомки реальних подій та осіб. Темою для документальних фільмів найчастіше стають історичні події, культурні та соціальні явища, відомі особистості та товариства.'
    },
    {id: 19, name: "Військовий", description: 'Жанр, який торкається війни.'},
    {
        id: 20,
        name: "Історичнеий",
        description: 'Жанр, у якому вигаданий сюжет розгортається на місці конкретних реальних історичних подій.'
    },
    {id: 21, name: "Бойове мистецтво", description: 'Жанр де присутні бойові мистецтва.'},
    {id: 22, name: "Вампіри", description: 'Жанр де присутні вампіри.'},
    {
        id: 23,
        name: "Гарем",
        description: 'Жанр стосунків в аніме та манзі, в якому персонаж чоловічої статі оточений великою кількістю жінок. Інших жорстких рамок жанру не задано, і в різновидах гарему герой зовсім не обов\'язково повинен зав\'язувати хоча б якісь романтичні відносини, проте найчастіше так відбувається.'
    },
    {id: 24, name: "Демони", description: 'Жанр де присутні демони або демоничні істоти.'},
    {id: 25, name: "Ігри", description: 'Жанр де присутні ігри або сам світ є частиною гри.'},
    {id: 26, name: "Космос", description: 'Жанр де присутні дії в космосі.'},
    {
        id: 27,
        name: "Магія",
        description: 'Специфічний жанр фантастики, піджанр фентезі, описує світи, де технологічні досягнення сусідять з проявами магії, або де наука і магія трансформуються один в одного.'
    },
    {id: 28, name: "Машини", description: 'Жанр в якому присутні машини.'},
    {id: 29, name: "Роботи", description: 'Жанр в якому присутні роботи якими як првело керують люди.'},
    {
        id: 30,
        name: "Пародія",
        description: 'Жанр у якому відбувається комічне чи сатиричне наслідування іншого тексту. Пародія в перебільшеному вигляді відтворює характерні особливості оригіналу.'
    },
    {
        id: 31,
        name: "Повсякденність",
        description: 'Жанр сучасної творчості, що натуралістично описує реальне життя героїв.'
    },
    {id: 32, name: "Поліція", description: 'Жанр де присутні правоохоронні органи.'},
    {id: 33, name: "Надприродне", description: 'Жанр де присутні надприродні явища, здібності або сила.'},
    {
        id: 34,
        name: "Сьодзьо",
        description: 'Жанр аніме і манґи, цільова аудиторія якого — дівчата у віці від 12 до 18 років.'
    },
    {
        id: 35,
        name: "Шьонен",
        description: 'Жанр аніме і манґи, основною цільовою аудиторією якого є підлітки та юнаки у віці від 12 до 18 років.'
    },
    {id: 36, name: "Сьонен-ай", description: 'Жанр аніме або манґи, присвячений любові між хлопцями, піджанр яою.'},
    {id: 37, name: "Суперсила", description: 'Жанр в якому присутня супер сила.'},
    {
        id: 38,
        name: "Сейнен",
        description: 'Жанр аніме і манґи, основною цільовою аудиторією якого є молоді чоловіки у віці від 18 до 25 років.'
    },
    {id: 39, name: "Дзьосей", description: 'Жанр для молодих жінок від 18 і старше.'},
    {id: 40, name: "Школа", description: 'Жанр де присутні сцени із школою або іншим навчальним закладом.'},
    {
        id: 41,
        name: "Етті",
        description: 'Жанр аніме або манґи, ключовою особливістю якого є показ еротичних сцен. На відміну від хентаю, етті не показує сексуальні стосунки безпосередньо, демонструючи, залежно від віку цільової аудиторії, різні по ступеню відвертості еротичні сцени з натяком на такі відносини.'
    },
    {
        id: 42,
        name: 'Містика'
    }
];

export enum Genre {
    Action = 1,
    Melodrama,
    Comedy,
    Adventures,
    Detective,
    Drama,
    Crime,
    Sport,
    Thriller,
    Horrors,
    Fantastuka,
    Fantasy,
    Music,
    Biography,
    Western,
    Romance,
    Family,
    Documentary,
    Military,
    Historical,
    BoyoveMystetstvo,
    Vampires,
    Harem,
    Demons,
    Game,
    Space,
    Magic,
    Cars,
    Robots,
    Parody,
    EverydayLife,
    Police,
    Supernatural,
    Shojo,
    Shonen,
    ShonenAi,
    SuperPower,
    Seinen,
    Dzyosei,
    School,
    Ettie,
    Mistica
}
